import { TKeyboardData, TKeyboardType } from '../types';

export const keyboardData: Record<TKeyboardType, TKeyboardData> = {
  text: {
    rus: {
      default: [
        ['й', 'ц', 'у', 'к', 'е', 'н', 'г', 'ш', 'щ', 'з', 'х', 'ъ'],
        ['ф', 'ы', 'в', 'а', 'п', 'р', 'о', 'л', 'д', 'ж', 'э'],
        ['SHIFT', 'я', 'ч', 'с', 'м', 'и', 'т', 'ь', 'б', 'ю', 'BACKSPACE'],
        ['NUM', 'LANG', 'SPACE', 'GO'],
      ],
      caps: [
        ['Й', 'Ц', 'У', 'К', 'Е', 'Н', 'Г', 'Ш', 'Щ', 'З', 'Х', 'Ъ'],
        ['Ф', 'Ы', 'В', 'А', 'П', 'Р', 'О', 'Л', 'Д', 'Ж', 'Э'],
        ['SHIFT', 'Я', 'Ч', 'С', 'М', 'И', 'Т', 'Ь', 'Б', 'Ю', 'BACKSPACE'],
        ['NUM', 'LANG', 'SPACE', 'GO'],
      ],
    },
    eng: {
      default: [
        ['q', 'w', 'e', 'r', 't', 'y', 'u', 'i', 'o', 'p'],
        ['a', 's', 'd', 'f', 'g', 'h', 'j', 'k', 'l'],
        ['SHIFT', 'z', 'x', 'c', 'v', 'b', 'n', 'm', 'BACKSPACE'],
        ['NUM', 'LANG', 'SPACE', 'GO'],
      ],
      caps: [
        ['Q', 'W', 'E', 'R', 'T', 'Y', 'U', 'I', 'O', 'P'],
        ['A', 'S', 'D', 'F', 'G', 'H', 'J', 'K', 'L'],
        ['SHIFT', 'Z', 'X', 'C', 'V', 'B', 'N', 'M', 'BACKSPACE'],
        ['NUM', 'LANG', 'SPACE', 'GO'],
      ],
    },
    num: {
      default: [
        ['1', '2', '3', '4', '5', '6', '7', '8', '9', '0'],
        ['-', '/', ':', ';', '(', ')', '&', '@', '“'],
        ['SHIFT', '.', ',', '?', '!', '‘', 'BACKSPACE'],
        ['NUM', 'LANG', 'SPACE', 'GO'],
      ],
      caps: [
        ['1', '2', '3', '4', '5', '6', '7', '8', '9', '0'],
        ['$', '!', ';', '?', '=', '@', '(', ')'],
        ['SHIFT', '.', '_', '-', '+', 'BACKSPACE'],
        ['NUM', 'LANG', 'SPACE', 'GO'],
      ],
    },
  },
  email: {
    rus: {
      default: [
        ['й', 'ц', 'у', 'к', 'е', 'н', 'г', 'ш', 'щ', 'з', 'х', 'ъ'],
        ['ф', 'ы', 'в', 'а', 'п', 'р', 'о', 'л', 'д', 'ж', 'э'],
        ['SHIFT', 'я', 'ч', 'с', 'м', 'и', 'т', 'ь', 'б', 'ю', 'BACKSPACE'],
        ['NUM', 'LANG', 'SPACE', '@', '.', 'GO'],
      ],
      caps: [
        ['Й', 'Ц', 'У', 'К', 'Е', 'Н', 'Г', 'Ш', 'Щ', 'З', 'Х', 'Ъ'],
        ['Ф', 'Ы', 'В', 'А', 'П', 'Р', 'О', 'Л', 'Д', 'Ж', 'Э'],
        ['SHIFT', 'Я', 'Ч', 'С', 'М', 'И', 'Т', 'Ь', 'Б', 'Ю', 'BACKSPACE'],
        ['NUM', 'LANG', 'SPACE', '@', '.', 'GO'],
      ],
    },
    eng: {
      default: [
        ['q', 'w', 'e', 'r', 't', 'y', 'u', 'i', 'o', 'p'],
        ['a', 's', 'd', 'f', 'g', 'h', 'j', 'k', 'l'],
        ['SHIFT', 'z', 'x', 'c', 'v', 'b', 'n', 'm', 'BACKSPACE'],
        ['NUM', 'LANG', 'SPACE', '@', '.', 'GO'],
      ],
      caps: [
        ['Q', 'W', 'E', 'R', 'T', 'Y', 'U', 'I', 'O', 'P'],
        ['A', 'S', 'D', 'F', 'G', 'H', 'J', 'K', 'L'],
        ['SHIFT', 'Z', 'X', 'C', 'V', 'B', 'N', 'M', 'BACKSPACE'],
        ['NUM', 'LANG', 'SPACE', '@', '.', 'GO'],
      ],
    },
    num: {
      default: [
        ['1', '2', '3', '4', '5', '6', '7', '8', '9', '0'],
        ['-', '/', ':', ';', '(', ')', '&', '@', '“'],
        ['SHIFT', '.', ',', '?', '!', '‘', 'BACKSPACE'],
        ['NUM', 'LANG', 'SPACE', '@', '.', 'GO'],
      ],
      caps: [
        ['1', '2', '3', '4', '5', '6', '7', '8', '9', '0'],
        ['$', '!', ';', '?', '=', '@', '(', ')'],
        ['SHIFT', '.', '_', '-', '+', 'BACKSPACE'],
        ['NUM', 'LANG', 'SPACE', '@', '.', 'GO'],
      ],
    },
  },
};
